% уровень 0
колесо_вкусов(сладкий).
колесо_вкусов(цветочный).
колесо_вкусов(фруктовый).
колесо_вкусов(кислый).
колесо_вкусов(растительный).
колесо_вкусов(другие).
колесо_вкусов(печеный).
колесо_вкусов(пряный).
колесо_вкусов(ореховый).
колесо_вкусов(какао).

% уровни 1-2
колесо_вкусов(сладкий, "сладкий запах").
колесо_вкусов(сладкий, "в целом сладкий").
колесо_вкусов(сладкий, "ванилин").
колесо_вкусов(сладкий, "ваниль").
колесо_вкусов(сладкий, "коричневый сахар").
колесо_вкусов("коричневый сахар", "мед").
колесо_вкусов("коричневый сахар", "карамель").
колесо_вкусов("коричневый сахар", "кленовый сироп").
колесо_вкусов("коричневый сахар", "меласса").

колесо_вкусов(какао, "темный шоколад").
колесо_вкусов(какао, "шоколад").

колесо_вкусов(ореховый, "миндаль").
колесо_вкусов(ореховый, "фундук").
колесо_вкусов(ореховый, "арахис").

колесо_вкусов(цветочный, "черный чай").
колесо_вкусов(цветочный, "роза").
колесо_вкусов(цветочный, "ромашка").

колесо_вкусов(фруктовый, "ягоды").
колесо_вкусов(фруктовый, "сухофрукты").
колесо_вкусов(фруктовый, "другие фрукты").
колесо_вкусов(фруктовый, "цитрусовый").
колесо_вкусов("ягоды", "ежевика").
колесо_вкусов("ягоды", "малина").
колесо_вкусов("ягоды", "черника").
колесо_вкусов("ягоды", "клубника").
колесо_вкусов("сухофрукты", "изюм").
колесо_вкусов("сухофрукты", "чернослив").
колесо_вкусов("другие фрукты", "кокос").
колесо_вкусов("другие фрукты", "вишня").
колесо_вкусов("другие фрукты", "гранат").
колесо_вкусов("другие фрукты", "ананас").
колесо_вкусов("другие фрукты", "виноград").
колесо_вкусов("другие фрукты", "яблоко").
колесо_вкусов("другие фрукты", "персик").
колесо_вкусов("другие фрукты", "груша").
колесо_вкусов("цитрусовый", "грейпфрут").
колесо_вкусов("цитрусовый", "апельсин").
колесо_вкусов("цитрусовый", "лимон").
колесо_вкусов("цитрусовый", "лайм").

колесо_вкусов(кислый, алкоголь).
колесо_вкусов(кислый, "кислый запах").
колесо_вкусов(кислый, "уксусная кислота").
колесо_вкусов(кислый, "масляная кислота").
колесо_вкусов(кислый, "лимонная кислота").
колесо_вкусов(кислый, "яблочная кислота").
колесо_вкусов(алкоголь, "вино").
колесо_вкусов(алкоголь, "виски").
колесо_вкусов(алкоголь, "забродивший").
колесо_вкусов(алкоголь, "перезрелый").

колесо_вкусов(растительный, "оливковое масло").
колесо_вкусов(растительный, "сырые продукты").
колесо_вкусов(растительный, "бобовый").
колесо_вкусов(растительный, "зелень").
колесо_вкусов("зелень", "незрелый").
колесо_вкусов("зелень", "стручковый горох").
колесо_вкусов("зелень", "свежий").
колесо_вкусов("зелень", "темная зелень").
колесо_вкусов("зелень", "сено").
колесо_вкусов("зелень", "пряные травы").


колесо_вкусов(пряный, перец).
колесо_вкусов(пряный, пикантный).
колесо_вкусов(пряный, "коричневые пряности").
колесо_вкусов("коричневые пряности", "гвоздика").
колесо_вкусов("коричневые пряности", "корица").
колесо_вкусов("коричневые пряности", "мускат").
колесо_вкусов("коричневые пряности", "анис").

колесо_вкусов(печеный, злаки).
колесо_вкусов(печеный, горелый).
колесо_вкусов(печеный, табак).
колесо_вкусов(печеный, "табак для трубки").
колесо_вкусов(злаки, "солод").
колесо_вкусов(злаки, "зерновой").
колесо_вкусов(горелый, "поджаренный").
колесо_вкусов(горелый, "дымный").
колесо_вкусов(горелый, "пепельный").
колесо_вкусов(горелый, "едкий").

колесо_вкусов(другие, "химический").
колесо_вкусов(другие, "бумажный/затхлый").
колесо_вкусов("химический", "резина").
колесо_вкусов("химический", "латекс").
колесо_вкусов("химический", "нефтяной").
колесо_вкусов("химический", "медицинский").
колесо_вкусов("химический", "соленый").
колесо_вкусов("химический", "горький").
колесо_вкусов("бумажный/затхлый", "затхлый").
колесо_вкусов("бумажный/затхлый", "картонный").
колесо_вкусов("бумажный/затхлый", "бумажный").
колесо_вкусов("бумажный/затхлый", "древесный").
колесо_вкусов("бумажный/затхлый", "сырой").
колесо_вкусов("бумажный/затхлый", "пыльный").
колесо_вкусов("бумажный/затхлый", "земельный").
колесо_вкусов("бумажный/затхлый", "животный").
колесо_вкусов("бумажный/затхлый", "мясной").
колесо_вкусов("бумажный/затхлый", "фенольный").

поддерево_колеса(X, Res):- колесо_вкусов(X, Res).
поддерево_колеса(X, Res):- колесо_вкусов(X, Tmp), колесо_вкусов(Tmp, Res).

% декриптор
дескриптор(X):- колесо_вкусов(X).
дескриптор(X):- колесо_вкусов(Y), колесо_вкусов(Y,X).