% глоссарий

% про кофе
info("сорт кофе", "Сорта кофе выделяются по странам-производителям. Дальнейшее деление не рассматривается").
info("сухая обработка", "Естественная сушка кофейных зерен").
info("мытая обработка", "Кофейные зерна замачивают в воде (ферментация)").
info("обжарка", "Термическая обработка зёрен кофе с целью придания получаемому из них напитку определённых вкусовых свойств. Чем сильнее обжарка, тем более горьким и менее кислотным получается кофе").
info("помол", "Выделяют различные степени помола кофе. Для каждого способа приготовления необходим своя степень помола").

info("вид кофе", "Основными видами для приготовления кофе являются арабика и робуста. Также (редко) встречаются либерика, эксцельза и другие...").
info("арабика", "Обладает интенсивным вкусом и кислотностью. Растет на больших высотах и требует постоянного ухода.Составляет около 70% всего производства кофе.").
info("робуста", "Более неприхотливый сорт кофе. Его зерна меньше, содержат больше кофеина, обладают более терпким и плоским вкусом.").

% про оценку результата
info("оценка кофе", "Наиболее общими показателями являются кислотность, сладость и горечь, которые вместе формируют баланс напитка. Также отмечают возможные дескрипторы вкуса").
info("кислотность", "Показатель того, насколько кофе имеет фруктовый или винный привкус. Зависит от высоты произрастания кофе, способа обработки зёрен, степени обжарки и приготовления").
info("сладость", "Мягкая, гладкая вкусовая характеристика, относящаяся к базовым вкусам. Сладость не подразумевает резкости, каких-либо дефектов вкуса, воспринимается как приятная, ощущается преимущественно на кончике языка").
info("дескриптор (вкуса)", "Ноты ягод, фруктов, орехов и пр., которые можно уловить во вкусе или аромате кофе. Существует иерархическое колесо вкусов для помощи в определении вкуса и аромата кофе").
info("горечь", "Является первичным вкусовым ощущением (однако может быть и ситуативной характеристикой или послевкусием), прежде всего ощущаемым у корня языка и на мягком небе").


% способы приготовления
% todo перечислить все рецепты с кратким описанием особенностей... мб завести отдельную стату "рецепты"
info("эспрессо", "Крепкий черный кофе, приготовленный с помощью кофемашины. На его основе созданы многие рецепты.").
info("ристретто", "Эспрессо с уменьшенной вдвое дозой воды, время варки - в 2 раза меньше, чем у классического эспрессо").
info("лунго", "Эспрессо с увеличенным количеством воды (вода используется в процессе приготовления, а не добавляется после)").
info("американо", "Эспрессо, разбавленный кипятком в пропорции 1:2 или 1:3").
info("лонг блэк", "Эспрессо наливается в кружку с горячей водой").
info("капучино", "Эспрессо с молоком, взбитым в пену").
info("флэт уайт", "Двойная порция эспрессо, куда добавляют немного горячего молока с пеной").
info("латте", "Эспрессо с молоком (молоко вливают в кофе), густой молочной пеной сверху").
info("латте макиато", "Эспрессо вливают в молоко таким образом, чтобы образовались слои. Сверху помещают молочную пену").
info("аффогато", "Ванильное мороженое, залитое двойным эспрессо").
info("кофе по-ирландски", "Эспрессо с ирландским виски, сахаром и пеной из взбитых сливок").
info("кофе в френч-прессе", "Для приготовления используется френч-пресс").
info("кофе в аэропрессе", "Для приготовления используется аэропресс").
info("кофе в сифоне", "Для приготовления используется сифон").
info("кофе в пуровере", "Для приготовления используется пуровер").
info("кофе в кемексе", "Для приготовления используется кемекс").

% инструменты
info("кофемашина", "Устройство для автоматического приготовления кофе").
info("френч-пресс", "(поршневая кофеварка) Иммерсионный метод заваривания, включающий в себя полное погружение промолотого кофе в воду, настаивание и последующую фильтрацию готового напитка").
info("аэропресс", "Приготовление кофе производится путём продавливания залитого горячей водой молотого кофе через фильтр под действием давления, создающегося за счёт мускульной силы оператора").
info("сифон", "(вакуумная кофеварка) Используются две камеры, где давление пара и сила тяжести производят кофе").
info("пуровер", "(V60) V-образная воронка с отверстием внизу, угол между стенками которой равен 60 градусов").
info("кемекс", "Кофейник в форме песочных часов, верхняя часть которого – воронка с фильтром, а нижняя – графин для напитка").

